// 자료 구조 ( data - structure)

// data : int, float, char *,&,[], struct, class

// 자료 : 기본, 선형
// 기본자료 : int 드읃ㅇ 프로그래밍 기본
// 복합 자료형 : 기본 자료형으로 표현하기 힘든 자료형을 새롭게 정의한 것

// 자료 구조 : 데이터를 잘 사용하기 위해 분류하는 것
// 시간 - 프로그램 실행 시간. 빠를수록 좋다
// 공간 - 
//

// Item :  플레이어 개인 창고를 위한 클래스
// Item item[10];
// 1. 롱소드 2. 방패. 3.갑옷 4.망치
// item[0] = 롱소드, item[1] 방패 ....... // 배열은 데이터를 처음 선언후 변경 불가
//  item[0] = null, ......
//   item[0] = 망치, ....... 

// 플레어가 착용하고 있는 아이템 정보 : 아이테믕ㄹ 정보를 전부다 검색해줘
// Item item[2] = new item();
// 아이템의 추가 또는 삭제가 있을때마다 배열 새로 만들어야함

// 자료구조를 배우는 이유
// 데이터를 잘 정리 도구
// 시공간
// 자료구조를 선택한다. 각 자료구조의 장단점 파악

// 자료구조의 분류 : 선형 비선형

//0. 배열 : 포인트 포인트 연산 - 배열 ptr+1 arr0+1
// 배열의 특징 : 연속적인 메모리 공간에 저장

// adt
// 가변 배열
// 
// 호환성
// 자료구조 :
// 직접 자료구조를 만드는 경ㅇ우는 드뭄 STL

// 1. 가변 배열(백터)
// 2. 연결리스트(링크리스트)
// 스택 큐
//4. 힙